app/controllers/api/chars_controller.rb

SELECT "chars".* FROM "chars"
---
    def index
        chars = Char.all

SELECT "chars".* FROM "chars" WHERE "chars"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
    def show
        # if Char.where(:xmin >= xmin && :xmax <= xmax && :ymin >= ymin && :ymax <= ymax).exists?
        #     char = Char.where(:xmin >= xmin && :xmax <= xmax && :ymin >= ymin && :ymax <= ymax)
        #     hit = true
        #     render json: char.to_json(:include => :hit)
        # else
        #     response = {hit: false}
        #     render json: response.to_json
        char = Char.find(params[:id])